# CFG
cask_args appdir: "/Applications"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "wez/wezterm"
# CLI
brew "autoconf"
brew "automake"
brew "awk", link: true
brew "binutils"
brew "bison"
brew "brotli"
brew "cmake"
brew "coreutils"
brew "cpanminus", link: true
brew "curl"
brew "exa"
brew "gcc"
brew "gdbm"
brew "gettext"
brew "git", link: true
brew "git-svn"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "go"
brew "grep"
brew "gzip"
brew "htop"
brew "jq"
brew "less", link: true
brew "libevent"
brew "libunistring"
brew "lua"
brew "luarocks"
brew "m4"
brew "make"
brew "ncurses", link: true
brew "neovim", link: true
brew "node@16", link: true
brew "npm"
brew "openssh"
brew "pcre2"
brew "perl", link: true
brew "ssh"
brew "stow"
brew "subversion"
brew "texinfo"
brew "tmux", link: true
brew "unzip"
brew "watch"
brew "wget"
brew "xz"
brew "zsh", link: true
brew "zstd"
# GUI
cask "1password"
cask "docker"
cask "font-blex-mono-nerd-font"
cask "hammerspoon"
cask "vivaldi"
cask "wezterm"
