tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "m4"
brew "asciidoctor"
brew "autoconf"
brew "automake"
brew "awk", link: false
brew "binutils"
brew "bison"
brew "cmake"
brew "coreutils"
brew "curl"
brew "exa"
brew "fd"
brew "fzf"
brew "gcc"
brew "git"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "go"
brew "grep"
brew "gzip"
brew "htop"
brew "jq"
brew "koekeishiya/formulae/yabai"
brew "koekeishiya/formulae/skhd"
brew "less"
brew "lua"
brew "luarocks"
brew "make"
brew "mas"
brew "ncurses"
brew "neovim"
brew "ninja"
brew "node"
brew "openjdk"
brew "pandoc"
brew "ripgrep"
brew "rust"
brew "shellcheck"
brew "subversion"
brew "shfmt"
brew "stow"
brew "subversion"
brew "tmux"
brew "topgrade"
brew "universal-ctags"
brew "unzip"
brew "wget"
brew "xz"
brew "zsh"
cask "1password"
cask "1password-cli"
cask "docker"
cask "font-blex-mono-nerd-font"
cask "hammerspoon"
cask "kitty"
cask "vivaldi-snapshot"
