tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "m4"
brew "autoconf"
brew "autojump"
brew "automake"
brew "awk"
brew "bat"
brew "binutils"
brew "bison"
brew "bpytop"
brew "glib"
brew "colordiff"
brew "coreutils"
brew "ctop"
brew "curl"
brew "diffutils"
brew "ed"
brew "exa"
brew "fd"
brew "file-formula"
brew "findutils"
brew "flex"
brew "fswatch"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gdb"
brew "gh"
brew "git"
brew "glances"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "go"
brew "googler"
brew "graphviz"
brew "grep"
brew "gzip"
brew "ncurses"
brew "htop"
brew "jq"
brew "lazydocker"
brew "less"
brew "libgccjit"
brew "libiconv"
brew "libidn"
brew "libvterm"
brew "lsyncd"
brew "lua"
brew "luarocks"
brew "make"
brew "ninja"
brew "node"
brew "openjdk"
brew "p7zip"
brew "pandoc"
brew "psutils"
brew "rename"
brew "ripgrep"
brew "rubyfmt"
brew "rust"
brew "shellcheck"
brew "shellharden"
brew "shfmt"
brew "stow"
brew "subversion"
brew "telnet"
brew "terraform"
brew "terraform-docs"
brew "tmux"
brew "topgrade"
brew "universal-ctags"
brew "unzip"
brew "watch"
brew "wdiff"
brew "wget"
brew "yamllint"
brew "yarn"
brew "youtube-dl"
brew "zsh"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "1password", args: { appdir: "/Applications" }
cask "font-sauce-code-pro-nerd-font"
cask "kitty", args: { appdir: "/Applications" }
cask "logitech-options"
cask "visual-studio-code-insiders"
cask "vivaldi"
