tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
brew "autoconf"
brew "automake"
brew "awk"
brew "binutils"
brew "bison"
brew "cmake"
brew "colordiff"
brew "coreutils"
brew "curl"
brew "diffutils"
brew "ed"
brew "exa"
brew "fd"
brew "ffmpeg"
brew "file-formula"
brew "findutils"
brew "flex"
brew "fswatch"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gdb"
brew "gh"
brew "git"
brew "glances"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "gnupg"
brew "go"
brew "gource"
brew "gpatch"
brew "grep"
brew "gzip"
brew "htop"
brew "jq"
brew "jupyterlab"
brew "less"
brew "libgccjit"
brew "libiconv"
brew "libidn"
brew "libpq"
brew "libvterm"
brew "lorem"
brew "lua"
brew "luarocks"
brew "m4"
brew "make"
brew "markdownlint-cli"
brew "mas"
brew "neovim"
brew "node"
brew "openjdk"
brew "openssl@1.1"
brew "p7zip"
brew "pandoc"
brew "pinentry-mac"
brew "pkg-config"
brew "psutils"
brew "ripgrep"
brew "runit"
brew "rust"
brew "shellcheck"
brew "shfmt"
brew "sphinx-doc"
brew "stow"
brew "telnet"
brew "tmux"
brew "topgrade"
brew "unzip"
brew "watch"
brew "wdiff"
brew "wget"
brew "yamllint"
brew "youtube-dl"
brew "zsh"
cask "1password", args: { appdir: "/Applications" }
cask "1password-cli"
cask "bartender", args: { appdir: "/Applications" }
cask "docker", args: { appdir: "/Applications" }
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "google-chrome"
cask "hammerspoon", args: { appdir: "/Applications" }
cask "keybase"
cask "kitty"
cask "logitech-firmwareupdatetool"
cask "logitech-options"
cask "logitech-unifying"
cask "omnifocus", args: { appdir: "/Applications" }
cask "spotify", args: { appdir: "/Applications" }
cask "visual-studio-code"

