tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

brew "autoconf"
brew "automake"
brew "binutils"
brew "bison"
brew "cmake"
brew "colordiff"
brew "coreutils"
brew "diffutils"
brew "ed"
brew "file-formula"
brew "findutils"
brew "flex"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gdb"
brew "git"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "gpatch"
brew "grep"
brew "gzip"
brew "less"
brew "m4"
brew "make"
brew "markdownlint-cli"
brew "neovim"
brew "node"
brew "ripgrep"
brew "shfmt"
brew "stow"
brew "tmux"
brew "unzip"
brew "watch"
brew "wdiff"
brew "wget"
brew "zsh"

cask "google-chrome"
cask "kitty"
cask "spotify"
